MoseychukA/FLARM_ALL/Base_Lan_ESP32/ChatGPT_FlyRF_LanNew/FlyRf_Lan_26_04_04_06/WebRF.cpp
</script>)rawliteral");
    html += F("</div></body></html>");
    return html;
}

static String monitorPage()
{
    String html = htmlBegin("&#1052;&#1086;&#1085;&#1080;&#1090;&#1086;&#1088; &#1089;&#1072;&#1084;&#1086;&#1083;&#1105;&#1090;&#1086;&#1074;");
    html += F("<h1>&#1052;&#1086;&#1085;&#1080;&#1090;&#1086;&#1088; &#1089;&#1072;&#1084;&#1086;&#1083;&#1105;&#1090;&#1086;&#1074;</h1>");
    html += F("<div class='monTools'><div class='monInfo'>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1074; Container: <span id='cnt'>0</span> | FLARM: <span id='flarmCnt'>0</span> | ADS-B: <span id='adsbCnt'>0</span></div><div><a class='btn' href='/'><span class='btnIcon'>&#127968;</span>&#1043;&#1083;&#1072;&#1074;&#1085;&#1072;&#1103;</a><a class='btn' href='/monitor'><span class='btnIcon'>&#128260;</span>&#1054;&#1073;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100;</a></div></div>");
    html += F("<table><tr><th>&#1057;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1082;&#1072;</th><td class='left'><select id='sortSel'><option value='age'>&#1057;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1085;&#1086;&#1074;&#1099;&#1077;</option><option value='dist'>&#1055;&#1086; &#1088;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1102;</option><option value='alt'>&#1055;&#1086; &#1074;&#1099;&#1089;&#1086;&#1090;&#1077;</option><option value='src'>&#1055;&#1086; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1091;</option><option value='icao'>&#1055;&#1086; ICAO</option></select></td></tr><tr><th>&#1052;&#1072;&#1082;&#1089;. &#1074;&#1086;&#1079;&#1088;&#1072;&#1089;&#1090;, &#1089;&#1077;&#1082;</th><td class='left'><select id='ageSel'><option value='0'>&#1041;&#1077;&#1079; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1072;</option><option value='10'>10</option><option value='30' selected>30</option><option value='60'>60</option><option value='120'>120</option></select></td></tr><tr><th>&#1058;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1072;&#1084;&#1080;</th><td class='left'><select id='posSel'><option value='0'>&#1053;&#1077;&#1090;</option><option value='1'>&#1044;&#1072;</option></select></td></tr></table>");
    html += F("<table class='monTable' id='acTable'><thead><tr><th>ICAO</th><th>&#1048;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;</th><th>&#1044;&#1080;&#1089;&#1090;., &#1082;&#1084;</th><th>Latitude</th><th>Longitude</th><th>Alt</th><th>Speed</th><th>Course</th><th>RSSI</th><th>SNR</th><th>Age, ms</th></tr></thead><tbody><tr><td colspan='11'>&#1053;&#1077;&#1090; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</td></tr></tbody></table>");
    html += F(R"rawliteral(
<script>
function esc(s){return String(s===undefined?"":s).replace(/[&<>\"]/g,function(c){return {'&':'&amp;','<':'&lt;','>':'&gt;','"':'&quot;'}[c];});}
function num(v,d){var n=Number(v); return isFinite(n)?n.toFixed(d):'';}
function upd(){fetch('/aircraft.json',{cache:'no-store'}).then(r=>r.json()).then(d=>{
  document.getElementById('cnt').textContent=d.count||0;
  document.getElementById('flarmCnt').textContent=d.flarm_count||0;
  document.getElementById('adsbCnt').textContent=d.adsb_count||0;
  var items=(d.items||[]).slice();
  var maxAge=Number(document.getElementById('ageSel').value||0);
  var posOnly=document.getElementById('posSel').value==='1';
  if(maxAge>0) items=items.filter(a=>Number(a.age_ms)<=maxAge*1000);
  if(posOnly) items=items.filter(a=>Math.abs(Number(a.lat))>0.00001 || Math.abs(Number(a.lon))>0.00001);
  var sort=document.getElementById('sortSel').value;
  items.sort(function(a,b){
    if(sort==='dist') return Number(a.distance_km)-Number(b.distance_km);
    if(sort==='alt') return Number(b.altitude)-Number(a.altitude);
    if(sort==='src') return String(a.source).localeCompare(String(b.source));
    if(sort==='icao') return String(a.icao).localeCompare(String(b.icao));
    return Number(a.age_ms)-Number(b.age_ms);
  });
  var body='';
  if(!items.length){body="<tr><td colspan='11'>??? ??????</td></tr>";}
  else{
    items.forEach(function(a){
      body += '<tr>'+
        '<td class="mono">'+esc(a.icao)+'</td>'+
        '<td>'+esc(a.source)+'</td>'+
        '<td>'+num(a.distance_km,2)+'</td>'+
        '<td>'+num(a.lat,5)+'</td>'+
        '<td>'+num(a.lon,5)+'</td>'+
        '<td>'+esc(a.altitude)+'</td>'+
        '<td>'+num(a.speed,1)+'</td>'+
        '<td>'+num(a.course,1)+'</td>'+
        '<td>'+esc(a.rssi)+'</td>'+
        '<td>'+num(a.snr,1)+'</td>'+
        '<td>'+esc(a.age_ms)+'</td>'+
      '</tr>';
    });
  }
  document.querySelector('#acTable tbody').innerHTML = body;
}).catch(function(){document.querySelector('#acTable tbody').innerHTML="<tr><td colspan='11'>?????? ????????? ??????</td></tr>";});}
['sortSel','ageSel','posSel'].forEach(function(id){document.addEventListener('change', function(e){ if(e.target && e.target.id===id) upd(); });});
upd(); setInterval(upd, 2000);
</script>)rawliteral");
    html += F("</div></body></html>");
    return html;
}

static void handleAircraftJson()
{
    String json;
    json.reserve(6144);
    json += "{\"count\":";
    json += String(TrafficDB.getCount());

    const Aircraft* list = TrafficDB.getList();
    const uint32_t nowMs = millis();
    int flarmCount = 0;
    int adsbCount = 0;
    for (int i = 0; i < MAX_AIRCRAFT; ++i)
    {
        if (!list[i].valid) continue;
        if (list[i].source == TRAFFIC_SOURCE_FLARM_LORA) flarmCount++;
        else if (list[i].source == TRAFFIC_SOURCE_ADSB_DUMP1090) adsbCount++;
    }

    json += ",\"flarm_count\":";
    json += String(flarmCount);
    json += ",\"adsb_count\":";
    json += String(adsbCount);
    json += ",\"items\":[";

    bool first = true;
    const float rxLat = settings ? settings->local_latitude : 0.0f;
    const float rxLon = settings ? settings->local_longitude : 0.0f;

    for (int i = 0; i < MAX_AIRCRAFT; ++i)
    {
        if (!list[i].valid) continue;
        if (!first) json += ',';
        first = false;

