MoseychukA/FLARM_ALL/Base_Lan_ESP32/ChatGPT_FlyRF_LanNew/FlyRf_Lan_26_04_04_06/WebRF.cpp
    String json = F("{\"ok\":true,\"reset_defaults\":");
    json += resetDefaults ? F("true") : F("false");
    json += F("}");
    sendNoCache();
    server.send(200, "application/json; charset=utf-8", json);
}

static void handleOutputsLive()
{
    if (!settings)
    {
        sendNoCache();
        server.send(500, "application/json; charset=utf-8", "{\"ok\":false,\"message\":\"settings not ready\"}");
        return;
    }

    if (server.hasArg("serial_out")) settings->serial_out = (uint8_t)clampInt(server.arg("serial_out").toInt(), OUTPUT_MODE_OFF, OUTPUT_MODE_FLARM);
    if (server.hasArg("rs485_out")) settings->rs485_out = (uint8_t)clampInt(server.arg("rs485_out").toInt(), OUTPUT_MODE_OFF, OUTPUT_MODE_FLARM);
    uint8_t lanMode = 0;
    if (server.hasArg("udp_on") && server.arg("udp_on").toInt() == 1) lanMode |= NMEA_OUT_UDP;
    settings->nmea_out = lanMode;
    if (server.hasArg("udp_port")) settings->udp_port = (uint16_t)clampInt(server.arg("udp_port").toInt(), 1, 65535);
    EEPROM_store();

    sendNoCache();
    server.send(200, "application/json; charset=utf-8", "{\"ok\":true}");
}

static void handleHardwareInput()
{
    bool defaultsLoaded = false;
    if (settings)
    {
        if (server.hasArg("default_settings") && server.arg("default_settings").toInt() == 1)
        {
            EEPROM_clear();
            defaultsLoaded = true;
        }
        else
        {
            if (server.hasArg("rssi_view")) settings->rssi_view = (uint8_t)clampInt(server.arg("rssi_view").toInt(), 0, 1);
            if (server.hasArg("display_set")) settings->display_set = (uint8_t)clampInt(server.arg("display_set").toInt(), INFO_DISTLAY_OFF, INFO_DISPLAY_MAXI);
            if (server.hasArg("tft_memory_view")) settings->tft_memory_view = (uint8_t)clampInt(server.arg("tft_memory_view").toInt(), 0, 1);
            if (server.hasArg("serial_out")) settings->serial_out = (uint8_t)clampInt(server.arg("serial_out").toInt(), OUTPUT_MODE_OFF, OUTPUT_MODE_FLARM);
            if (server.hasArg("rs485_out")) settings->rs485_out = (uint8_t)clampInt(server.arg("rs485_out").toInt(), OUTPUT_MODE_OFF, OUTPUT_MODE_FLARM);
            if (server.hasArg("lan_state_view")) settings->lan_state_view = (uint8_t)clampInt(server.arg("lan_state_view").toInt(), 0, 1);
            if (server.hasArg("lora_fixed_channel")) settings->lora_fixed_channel = (uint8_t)clampInt(server.arg("lora_fixed_channel").toInt(), 0, 1);
        if (server.hasArg("lora_fixed_freq")) settings->lora_fixed_freq = (uint8_t)clampInt(server.arg("lora_fixed_freq").toInt(), 0, 9);
        if (server.hasArg("lora_profile")) settings->lora_profile = (uint8_t)clampInt(server.arg("lora_profile").toInt(), 0, 3);
                if (server.hasArg("view_test_coord")) settings->view_test_coord = (uint8_t)clampInt(server.arg("view_test_coord").toInt(), 0, 1);
            if (server.hasArg("radar_range_mode")) settings->radar_range_mode = (uint8_t)clampInt(server.arg("radar_range_mode").toInt(), 0, 1);
            if (server.hasArg("block_addr")) settings->block_addr = (uint32_t)strtoul(server.arg("block_addr").c_str(), nullptr, 16);
            if (server.hasArg("threshold_level")) settings->threshold_level = (int16_t)clampInt(server.arg("threshold_level").toInt(), 0, 4095);
            EEPROM_store();
        }
        RP2040Bridge_sendGainNow();
    }
    sendPage(hardwareSavedPage(defaultsLoaded));
}

static void handleOutputsSave()
{
    if (settings)
    {
        if (server.hasArg("serial_out")) settings->serial_out = (uint8_t)clampInt(server.arg("serial_out").toInt(), OUTPUT_MODE_OFF, OUTPUT_MODE_FLARM);
        if (server.hasArg("rs485_out")) settings->rs485_out = (uint8_t)clampInt(server.arg("rs485_out").toInt(), OUTPUT_MODE_OFF, OUTPUT_MODE_FLARM);
        uint8_t lanMode = 0;
        if (server.hasArg("udp_on") && server.arg("udp_on").toInt() == 1) lanMode |= NMEA_OUT_UDP;
        settings->nmea_out = lanMode;
        if (server.hasArg("udp_port")) settings->udp_port = (uint16_t)clampInt(server.arg("udp_port").toInt(), 1, 65535);
        EEPROM_store();
    }
    sendPage(outputsSavedPage());
}

static void handlePacketCounters()
{
    uint32_t txPackets = 0;
    uint32_t rxPackets = 0;
    RF_GetPacketCounters(txPackets, rxPackets);

    uint32_t lanTxPackets = 0;
    uint32_t lanRxPackets = 0;
    uint32_t lanUdpTxPackets = 0;
    uint32_t lanUdpRxPackets = 0;
    uint32_t lanTcpTxPackets = 0;
    uint32_t lanTcpRxPackets = 0;
    LAN_getPacketCounters(lanTxPackets, lanRxPackets, lanUdpTxPackets, lanUdpRxPackets, lanTcpTxPackets, lanTcpRxPackets);

    String json = F("{\"tx\":");
    json += String(txPackets);
    json += F(",\"rx\":");
    json += String(rxPackets);
    json += F(",\"lan_tx\":");
    json += String(lanTxPackets);
    json += F(",\"lan_rx\":");
    json += String(lanRxPackets);
    json += F(",\"lan_udp_tx\":");
    json += String(lanUdpTxPackets);
    json += F(",\"lan_udp_rx\":");
    json += String(lanUdpRxPackets);
    json += F(",\"lan_tcp_tx\":");
    json += String(lanTcpTxPackets);
    json += F(",\"lan_tcp_rx\":");
    json += String(lanTcpRxPackets);
    json += F(",\"mac\":\"");
    json += LAN_macAddressStr();
    json += F("\",\"tcp_addr\":\"");
    json += LAN_tcpAddressStr();
    json += F("\",\"lan_link_text\":\"");
    json += LAN_linkStatusStr();
    json += F("\",\"lan_dhcp\":");
    json += LAN_dhcpLeaseActive() ? F("true") : F("false");
    json += F("}");
    sendNoCache();
    server.send(200, "application/json; charset=utf-8", json);
}

static void handleOtaStatus()
{
    String json = F("{\"in_progress\":");
    json += g_otaInProgress ? F("true") : F("false");
    json += F(",\"written\":");
    json += String(g_otaWritten);
    json += F(",\"total\":");
    json += String(g_otaTotal);
    json += F(",\"ok\":");
    json += g_updateOk ? F("true") : F("false");
    json += F(",\"message\":\"");
    String msg = g_updateMessage;
    msg.replace("\\", "\\\\");
    msg.replace("\"", "\\\"");
    msg.replace("\r", " ");
    msg.replace("\n", " ");
    json += msg;
    json += F("\"}");
    sendNoCache();
    server.send(200, "application/json; charset=utf-8", json);
}

